# YOLOv8 🌟 - C2f_DBB (Diverse Branch Block)
# 用 DBB 替换标准 Bottleneck，训练时多分支、推理时融合
# 精度优于标准 YOLOv8，推理速度持平
# 参数量: 略增 (~10-15%)

# Parameters
nc: 80
scales:
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]     # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]     # 1-P2/4
  - [-1, 3, C2f_DBB, [128, True]]  # 2  ← DBB
  - [-1, 1, Conv, [256, 3, 2]]     # 3-P3/8
  - [-1, 6, C2f_DBB, [256, True]]  # 4  ← DBB
  - [-1, 1, Conv, [512, 3, 2]]     # 5-P4/16
  - [-1, 6, C2f_DBB, [512, True]]  # 6  ← DBB
  - [-1, 1, Conv, [1024, 3, 2]]    # 7-P5/32
  - [-1, 3, C2f_DBB, [1024, True]] # 8  ← DBB
  - [-1, 1, SPPF, [1024, 5]]       # 9

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 3, C2f_DBB, [512]]        # 12 ← DBB

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 3, C2f_DBB, [256]]        # 15 (P3/8-small) ← DBB

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]
  - [-1, 3, C2f_DBB, [512]]        # 18 (P4/16-medium) ← DBB

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 9], 1, Concat, [1]]
  - [-1, 3, C2f_DBB, [1024]]       # 21 (P5/32-large) ← DBB

  - [[15, 18, 21], 1, Detect, [nc]]
