# YOLOv8 🌟 - DyHead + DCNV4
# 动态检测头 + DCNV4
# 在 P4/P5 层使用 DCNV4 增强检测头
# 保留 P3 (小目标) 使用 DBB
# 
# 精度最高配置 (但参数量最大)

# Parameters
nc: 80
scales:
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 3, C2f_DBB, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 6, C2f_DBB, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 6, C2f_DBB, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]
  - [-1, 3, C2f_DBB, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 3, C2f_DCNV4, [512]]

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 3, C2f_DBB, [256]]

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]
  - [-1, 3, C2f_DCNV4, [512]]

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 9], 1, Concat, [1]]
  - [-1, 3, C2f_DCNV4, [1024]]

  - [[15, 18, 21], 1, Detect, [nc]]
